Revit 2027 API
FamilyManager.GetAssociatedFamilyParameter Method
Gets the associated family parameter of an element parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter GetAssociatedFamilyParameter(
	Parameter elementParameter
)
Public Function GetAssociatedFamilyParameter (
	elementParameter As Parameter
) As FamilyParameter
public:
FamilyParameter^ GetAssociatedFamilyParameter(
	Parameter^ elementParameter
)
member GetAssociatedFamilyParameter :
        elementParameter : Parameter -> FamilyParameter
Parameters
elementParameter Parameter
The parameter of an element in family.
Return Value
FamilyParameter
The associated family parameter if there is an association between them, returns null if not.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"elementParameter"-is null.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace